In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Pandas Foundations

DataFrame is just like a spreadsheet, and Series is the single columns of data inside the DataFrame, each column(Series) holds precisely one data type. 

Both DataFrame and Series has Index component, one key reason that makes them so special and handy to use.

DataFrame and Series consist of three components Index,columns and data(values).

When you need to select one specific data element or subset of data, use index label and column name to find the target.

The first step (suppose we already have csv,excel or sql files at hand, which in reality, is seldom the case) is to read the data into the dataframe.
We have a very powerful and versatile function read_csv (read the official document for more details,mutiple parameters making this function very flexible).

In [6]:
data=pd.read_csv('BikeRiding2012.csv',index_col='Date',parse_dates=['Date'],dayfirst=True)

In [7]:
data.head()  # read the first few rows,to get a feel of the data.

,Unnamed: 1,Rachel / Papineau,Berri1,Maisonneuve_2,Maisonneuve_1,Brébeuf,Parc,PierDup,CSC (Côte Sainte-Catherine),Pont_Jacques_Cartier
Date,,,,,,,,,,
2012-01-01,00:00,16,35,51,38,5.0,26,10,0,27.0
2012-01-02,00:00,43,83,153,68,11.0,53,6,1,21.0
2012-01-03,00:00,58,135,248,104,2.0,89,3,2,15.0
2012-01-04,00:00,61,144,318,116,2.0,111,8,1,19.0
2012-01-05,00:00,95,197,330,124,6.0,97,13,2,16.0

In [8]:
data.index #in this exmple, the idexes are dates.

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06', '2012-01-07', '2012-01-08',
               '2012-01-09', '2012-01-10',
               ...
               '2012-12-22', '2012-12-23', '2012-12-24', '2012-12-25',
               '2012-12-26', '2012-12-27', '2012-12-28', '2012-12-29',
               '2012-12-30', '2012-12-31'],
              dtype='datetime64[ns]', name='Date', length=366, freq=None)

In [9]:
data.columns

Index(['Unnamed: 1', 'Rachel / Papineau', 'Berri1', 'Maisonneuve_2',
       'Maisonneuve_1', 'Brébeuf', 'Parc', 'PierDup',
       'CSC (Côte Sainte-Catherine)', 'Pont_Jacques_Cartier'],
      dtype='object')

In [12]:
data.values  # numpy arrays

array([['00:00', 16, 35, ..., 10, 0, 27.0],
       ['00:00', 43, 83, ..., 6, 1, 21.0],
       ['00:00', 58, 135, ..., 3, 2, 15.0],
       ...,
       ['00:00', 0, 27, ..., 0, 0, nan],
       ['00:00', 0, 5, ..., 0, 0, nan],
       ['00:00', 0, 4, ..., 0, 0, nan]], dtype=object)

Data can be continuous ( height, weight....) and categorical( gender, color....)
pandas sponsor Boolean,Integer,Float,Complex,Object,Datetime,Timedelta,Categorical.
(the object data type is a catch-all)

In [14]:
data.dtypes

Unnamed: 1                      object
Rachel / Papineau                int64
Berri1                           int64
Maisonneuve_2                    int64
Maisonneuve_1                    int64
Brébeuf                        float64
Parc                             int64
PierDup                          int64
CSC (Côte Sainte-Catherine)      int64
Pont_Jacques_Cartier           float64
dtype: object

In [15]:
data.get_dtype_counts()

float64    2
int64      7
object     1
dtype: int64

A Series a single column of DataFrame. A series is composed of an index and the values.
One common operation is to select one column(Series) from the dataframe, to do this, pass  the string to the indexing operator of the dataframe.

In [16]:
ParcData=data['Parc']  # return a series. alternative: ParcData=data.Parc

In [17]:
ParcData.head()    #

Date
2012-01-01     26
2012-01-02     53
2012-01-03     89
2012-01-04    111
2012-01-05     97
Name: Parc, dtype: int64

In [18]:
type(ParcData)

pandas.core.series.Series

Note: the dot notation(ParcData=data.Parc) is not recommended to use in production, which is prone to error. (what if the column name is 'zip code')

in case you want to convert a Series to data frame use to_frame() function.

Series has many powerful functions and share a lot in common with DataFrames.

In [21]:
objSeries=data['Unnamed: 1']   # to emphasize the diff, this is not a good name btw.
intSeries=data['Berri1']

In [22]:
objSeries.value_counts() #this column only has one value...

00:00    366
Name: Unnamed: 1, dtype: int64

In [25]:
intSeries.describe()

count     366.000000
mean     2678.234973
std      2149.301945
min         4.000000
25%       433.500000
50%      2326.000000
75%      4642.750000
max      7104.000000
Name: Berri1, dtype: float64

For object data types, the most commonly used function is value_counts()
For numerical data types, a good choice might be describe(), or you can use min(),max(),mean(),median(),std(),quantile() and sum() to do some basic statistic calculations.

In [26]:
objSeries.count()

366

In [28]:
objSeries.size

366

Note, to count the number of elements of the Series, you can use size and shape parameter or the len func. but as you can see there is also a count() func, this one is counting all the non-missing values.

In [31]:
intSeries.isnull()

Date
2012-01-01    False
2012-01-02    False
2012-01-03    False
2012-01-04    False
2012-01-05    False
2012-01-06    False
2012-01-07    False
2012-01-08    False
2012-01-09    False
2012-01-10    False
2012-01-11    False
2012-01-12    False
2012-01-13    False
2012-01-14    False
2012-01-15    False
2012-01-16    False
2012-01-17    False
2012-01-18    False
2012-01-19    False
2012-01-20    False
2012-01-21    False
2012-01-22    False
2012-01-23    False
2012-01-24    False
2012-01-25    False
2012-01-26    False
2012-01-27    False
2012-01-28    False
2012-01-29    False
2012-01-30    False
              ...
2012-12-02    False
2012-12-03    False
2012-12-04    False
2012-12-05    False
2012-12-06    False
2012-12-07    False
2012-12-08    False
2012-12-09    False
2012-12-10    False
2012-12-11    False
2012-12-12    False
2012-12-13    False
2012-12-14    False
2012-12-15    False
2012-12-16    False
2012-12-17    False
2012-12-18    False
2012-12-19    False
2012-12-20    False
2012-12-21    False
2012-12-22    False
2012-12-23    False
2012-12-24    False
2012-12-25    False
2012-12-26    False
2012-12-27    False
2012-12-28    False
2012-12-29    False
2012-12-30    False
2012-12-31    False
Name: Berri1, Length: 366, dtype: bool

In [32]:
intSeries.isnull().sum() # get the number of null values in the series, in this case, no null values.

0

In [33]:
intSeries.notnull().sum()

366

In the upper example, intSeries.notnull().sum() ,we actually used what is called Method chaining, because as the first func returns a new series, we can call another func on this new series, and it goes on and on, but sometimes this should be avoided to better readability.

Next, we will do manipulation with DataFrames, as you will see, it share a lot funcs with Series.

In [39]:
example=pd.DataFrame({'Id':[1001,1002,1003,1004,1005,1006],
                    'Name':['Chris','Laura','Jack','Ellen','John','Max'],
                     'Age':[12,34,22,np.nan,23,20],
                     'Gender':['M','F','M','F','M','M'],
                     'GPA':[3.0,3.3,2.9,3.5,3.1,3.8]})
# here we manually built a dataframe to better explain the concepts.

In [41]:
example

    Age  GPA Gender    Id   Name
0  12.0  3.0      M  1001  Chris
1  34.0  3.3      F  1002  Laura
2  22.0  2.9      M  1003   Jack
3   NaN  3.5      F  1004  Ellen
4  23.0  3.1      M  1005   John
5  20.0  3.8      M  1006    Max

In [42]:
example.set_index('Id',inplace=True)

In [43]:
example.head()

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John

In [44]:
example.isnull().sum().sum() # check if there is null value in this df, there is a null value

1

In [46]:
example['Age'].isnull().sum()

1

In [48]:
example['Age'].fillna(example['Age'].mean()).astype(int)  # if you want it inplace add inplace=True in the fillna() func

Id
1001    12
1002    34
1003    22
1004    22
1005    23
1006    20
Name: Age, dtype: int32

Sometimes, the default index (0,1,2...n-1) is not very meaningful, if the data already contain column that acts as the identifier, we can set this column as the index use the set_index() func.

In [50]:
columns_rename={'Id':'Student_id','Name':'Student_name','Age':'Student_age'}
example=example.rename(columns=columns_rename)

In [51]:
example

      Student_age  GPA Gender Student_name
Id
1001         12.0  3.0      M        Chris
1002         34.0  3.3      F        Laura
1003         22.0  2.9      M         Jack
1004          NaN  3.5      F        Ellen
1005         23.0  3.1      M         John
1006         20.0  3.8      M          Max

In [52]:
example.columns

Index(['Student_age', 'GPA', 'Gender', 'Student_name'], dtype='object')

In [53]:
example.columns=['Age','GPA','Gender','Name'] # another way to set column names

In [54]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

In many cases, you might need to add new columns or delete columns

In [55]:
example['Department']='NotKnown'

In [56]:
example

       Age  GPA Gender   Name Department
Id
1001  12.0  3.0      M  Chris   NotKnown
1002  34.0  3.3      F  Laura   NotKnown
1003  22.0  2.9      M   Jack   NotKnown
1004   NaN  3.5      F  Ellen   NotKnown
1005  23.0  3.1      M   John   NotKnown
1006  20.0  3.8      M    Max   NotKnown

In [57]:
del example['Department']

In [58]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

In [59]:
example['Adult']=example['Age']>=18

In [60]:
example

       Age  GPA Gender   Name  Adult
Id
1001  12.0  3.0      M  Chris  False
1002  34.0  3.3      F  Laura   True
1003  22.0  2.9      M   Jack   True
1004   NaN  3.5      F  Ellen  False
1005  23.0  3.1      M   John   True
1006  20.0  3.8      M    Max   True

In [62]:
example['Adult'].all()  # check if all true

False

In [63]:
example=example.drop('Adult',axis=1) # another way to delete a column default: drop rows

In [64]:
example

       Age  GPA Gender   Name
Id
1001  12.0  3.0      M  Chris
1002  34.0  3.3      F  Laura
1003  22.0  2.9      M   Jack
1004   NaN  3.5      F  Ellen
1005  23.0  3.1      M   John
1006  20.0  3.8      M    Max

Note: Dataframe has two axis, axis=0 which is the default and axis=1. to memorize this, we can say when axis=0 we are getting or losing a row.  when axis=1, we are getting or losing a column, I find this the best way to memorize this.

In the previous example, we are always working on a single column. what if we want to work on multiple columns, simply pass a list of target column names to the indexing operator, so if you pass a string, you will get a Series, if you pass a list, you will get a new dataframe.

In [66]:
Student_Age_Name=example[['Name','Age']]

In [67]:
Student_Age_Name

       Name   Age
Id
1001  Chris  12.0
1002  Laura  34.0
1003   Jack  22.0
1004  Ellen   NaN
1005   John  23.0
1006    Max  20.0

another way to get columns is using method, such as filter
df.filter(like='targetInfo')

In [72]:
example.Gender.nunique()

2

selecting subsets of data

df.iloc[rows,columns]
df.loc[rows,columns]
here, rows and columns can be scalar values, lists,slice objects or boolean sequences.

In [84]:
example.loc[: ,['Name','Age']]

       Name   Age
Id
1001  Chris  12.0
1002  Laura  34.0
1003   Jack  22.0
1004  Ellen   NaN
1005   John  23.0
1006    Max  20.0

In [85]:
example.loc['1001':'1004','Age':'Gender']

       Age  GPA Gender
Id
1001  12.0  3.0      M
1002  34.0  3.3      F
1003  22.0  2.9      M
1004   NaN  3.5      F

another way is using boolean filter or boolean indexing

In [88]:
AdultOrNot=example['Age']>=18

In [89]:
AdultOrNot

Id
1001    False
1002     True
1003     True
1004    False
1005     True
1006     True
Name: Age, dtype: bool

In [90]:
AdultOrNot.sum()

4

In [91]:
AdultOrNot.mean() # about 67% of students are adults.

0.66666666666666663

In [95]:
criteria1=example.Gender=='F'
criteria2=example.Age>=18
criteria3=example.GPA>3.0

criterias=criteria1&criteria2&criteria3
criterias

Id
1001    False
1002     True
1003    False
1004    False
1005     True
1006     True
dtype: bool

In [96]:
example[criterias]

       Age  GPA Gender   Name
Id
1002  34.0  3.3      F  Laura
1005  23.0  3.1      F   John
1006  20.0  3.8      F    Max

Note: the comparison operators have a higher precedence than and ,or and not.
the bitwise operators &|and ~ have higher precedence than comparison operators.
the best practice as to add parentheses.

in the upper example, we use & instead of keyword and. because, and ,or and not keywords evaluate the truthiness of the objects as whole. it make no sense to check if a whole series is truth not so we use & .